/*
Вася не любит английский язык, но каждый раз старается получить хотя бы четверку за четверть, чтобы оставаться ударником.
В текущей четверти Вася заметил следующую закономерность: по нечетным дням месяца он получал тройки, а по четным – четверки.
Так же он помнит, в какие дни он получал эти оценки. Поэтому он выписал на бумажке все эти дни для того, чтобы оценить, сколько у него троек и сколько четверок.
Помогите Васе это сделать, расположив четные и нечетные числа в разных строчках. Вася может рассчитывать на оценку 4, если четверок не меньше, чем троек.

Входные данные
В первой строке входного файла INPUT.TXT записано единственное число N – количество элементов целочисленного массива (1 ≤ N ≤ 100).
Вторая строка содержит N чисел, представляющих заданный массив. Каждый элемент массива – натуральное число от 1 до 31. Все элементы массива разделены пробелом.

Выходные данные
В первую строку выходного файла OUTPUT.TXT нужно вывести числа, которые соответствуют дням месяцев,
в которые Вася получил тройки, а во второй строке соответственно расположить числа месяца, в которые Вася получил четверки.
В третьей строке нужно вывести «YES», если Вася может рассчитывать на четверку и «NO» в противном случае.
В каждой строчке числа следует выводить в том же порядке, в котором они идут во входных данных. При выводе числа отделяются пробелом.
*/

string path_input = Directory.GetCurrentDirectory() + "\\INPUT.txt";
string path_output = Directory.GetCurrentDirectory() + "\\OUTPUT.txt";

string[] lines = System.IO.File.ReadAllLines(path_input);

int n = int.Parse(lines[0]);
int[] arr = lines[1].Split(' ').Select(p => int.Parse(p)).ToArray();

List<int> evens = new List<int>();
List<int> odds = new List<int>();

for (int i = 0; i <= arr.Length - 1; i++)
{
    if (arr[i] % 2 == 1) odds.Add(arr[i]);
    else evens.Add(arr[i]);
}

StreamWriter writer = new StreamWriter(path_output, false);
writer.WriteLine($"{string.Join(", ", odds)}");
writer.WriteLine($"{string.Join(", ", evens)}");
if (evens.Count > odds.Count) writer.Write("YES");
else writer.Write("YES");
writer.Close();